#!/usr/bin/env python3

symbols = {
    "MyClass": """
DW_TAG_structure_type
              DW_AT_name	("MyClass")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(2)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelBase::RootClass")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(2)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(3)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("y")
                DW_AT_type	("real(64)")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(4)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x10)
  NULL
""",
"MyRecord1":"""
DW_TAG_structure_type
              DW_AT_name	("MyRecord1")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(7)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("myField")
                DW_AT_type	("std::nullptr_t")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(8)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
"MyRecord2":"""
DW_TAG_structure_type
              DW_AT_name	("MyRecord2")
              DW_AT_byte_size	(0x68)
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(17)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("myFieldA")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(18)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myFieldB")
                DW_AT_type	("real(64)")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(19)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("myFieldC")
                DW_AT_type	("ChapelTuple::(int(64),real(64))")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(20)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x10)
  DW_TAG_member
                DW_AT_name	("myFieldD")
                DW_AT_type	("String::string")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(21)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("myFieldE")
                DW_AT_type	("std::nullptr_t")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(22)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("myFieldF")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] int(64)")
                DW_AT_decl_file	("./basicTypes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x50)
  NULL
""",
"myEnum":"""
DW_TAG_enumeration_type
              DW_AT_type	("int(64)")
              DW_AT_enum_class	(true)
              DW_AT_name	("ENUM_NAME")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(26)
              DW_AT_alignment	(8)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  NULL
""",
"myRec":"""
DW_TAG_variable
              DW_AT_name	("myRec")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(33)
              DW_AT_type	("basicTypes::MyRecord1")
""",
"myRec2":"""
DW_TAG_variable
              DW_AT_name	("myRec2")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(34)
              DW_AT_type	("basicTypes::MyRecord2")
""",
"myUnmanagedClass":"""
DW_TAG_variable
              DW_AT_name	("myUnmanagedClass")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(35)
              DW_AT_type	("basicTypes::MyClass")
""",
"myClass":"""
DW_TAG_variable
              DW_AT_name	("myClass")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(37)
              DW_AT_type	("OwnedObject::owned MyClass")
""",
"myStr":"""
DW_TAG_variable
              DW_AT_name	("myStr")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(38)
              DW_AT_type	("String::string")
""",
"myDom":"""
DW_TAG_variable
              DW_AT_name	("myDom")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(39)
              DW_AT_type	("ChapelDomain::domain(2,int(64),positive)")
""",
"myArr2d":"""
DW_TAG_variable
              DW_AT_name	("myArr2d")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(40)
              DW_AT_type	("ChapelArray::[domain(2,int(64),positive)] int(64)")

""",
"myArr":"""
DW_TAG_variable
              DW_AT_name	("myArr")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(41)
              DW_AT_type	("ChapelArray::[domain(1,int(64),one)] int(64)")
""",
"myBool":"""
DW_TAG_variable
              DW_AT_name	("myBool")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(42)
              DW_AT_type	("bool")
""",
"myInt":"""
DW_TAG_variable
              DW_AT_name	("myInt")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(43)
              DW_AT_type	("int(64)")
""",
"myReal":"""
DW_TAG_variable
              DW_AT_name	("myReal")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(44)
              DW_AT_type	("real(64)")
""",
"myEnumVal":"""
DW_TAG_variable
              DW_AT_name	("myEnumVal")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(45)
              DW_AT_type	("basicTypes::myEnum")
""",
"myEnumRef": """
DW_TAG_variable
              DW_AT_name	("myEnumRef")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(46)
              DW_AT_type	("basicTypes::myEnum *")
""",
"myTuple": """
DW_TAG_variable
              DW_AT_name	("myTuple")
              DW_AT_decl_file	("./basicTypes.chpl")
              DW_AT_decl_line	(47)
              DW_AT_type	("ChapelTuple::(int(64),string,real(64),myEnum)")
""",
"[domain(1,int(64),one)] int(64)": """
DW_TAG_structure_type
              DW_AT_name	("[domain(1,int(64),one)] int(64)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("std::nullptr_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
""",
"domain(2,int(64),positive)": """
DW_TAG_structure_type
              DW_AT_name	("domain(2,int(64),positive)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line	(1053)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line	(1054)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("std::nullptr_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line	(1056)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line	(1057)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
"""
}
from dwarfDump import run
run(symbols)
