#!/usr/bin/env python3

# TODO: ADD TRHE OTHER myRec
symbols = {
  "myRec(MyClass)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(MyClass)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("classes::MyClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(owned MyClass)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyClass)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("OwnedObject::owned MyClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(shared MyClass)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("SharedObject::shared MyClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(unmanaged MyClass)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyClass)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("classes::MyClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(borrowed MyClass?)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(borrowed MyClass?)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("classes::MyClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(owned MyClass?)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyClass?)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("OwnedObject::owned MyClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(shared MyClass?)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("SharedObject::shared MyClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "myRec(unmanaged MyClass?)": """
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyClass?)")
              DW_AT_byte_size	(0x08)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(4)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("classes::MyClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(5)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
""",
  "MyClass": """
DW_TAG_pointer_type
              DW_AT_type	("classes::MyClass")
              DW_AT_name	("MyClass")
DW_TAG_structure_type
              DW_AT_name	("MyClass")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(7)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelBase::RootClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(7)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(8)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
DW_TAG_structure_type
              DW_AT_name	("MyClass")
              DW_AT_declaration	(true)
              DW_AT_alignment	(8)
DW_TAG_pointer_type
              DW_AT_type	("classes::MyClass")
              DW_AT_name	("MyClass")
""",
  "myUnmanagedClass": """
DW_TAG_variable
              DW_AT_name	("myUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(13)
              DW_AT_type	("classes::MyClass *")
""",
  "myOwnedClass": """
DW_TAG_variable
              DW_AT_name	("myOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(15)
              DW_AT_type	("OwnedObject::owned MyClass")
""",
  "mySharedClass": """
DW_TAG_variable
              DW_AT_name	("mySharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(16)
              DW_AT_type	("SharedObject::shared MyClass")
""",
  "myBorrowedClass": """
DW_TAG_variable
              DW_AT_name	("myBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(17)
              DW_AT_type	("classes::MyClass *")
""",
  "myNilableUnmanagedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_type	("classes::MyClass *")
""",
  "myNilableOwnedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(23)
              DW_AT_type	("OwnedObject::owned MyClass?")
""",
  "myNilableSharedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableSharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(24)
              DW_AT_type	("SharedObject::shared MyClass?")
""",
  "myNilableBorrowedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(25)
              DW_AT_type	("classes::MyClass *")
""",
  "myRecordWrappedUnmanagedClass": """
DW_TAG_variable
              DW_AT_name	("myRecordWrappedUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(30)
              DW_AT_type	("classes::myRec(unmanaged MyClass)")
""",
  "myRecordWrappedOwnedClass": """
DW_TAG_variable
              DW_AT_name	("myRecordWrappedOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(32)
              DW_AT_type	("classes::myRec(owned MyClass)")
""",
  "myRecordWrappedSharedClass": """
DW_TAG_variable
              DW_AT_name	("myRecordWrappedSharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(33)
              DW_AT_type	("classes::myRec(shared MyClass)")
""",
  "myRecordWrappedBorrowedClass": """
DW_TAG_variable
              DW_AT_name	("myRecordWrappedBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(34)
              DW_AT_type	("classes::myRec(MyClass)")
""",
  "myNilableRecordWrappedUnmanagedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableRecordWrappedUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(39)
              DW_AT_type	("classes::myRec(unmanaged MyClass?)")
""",
  "myNilableRecordWrappedOwnedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableRecordWrappedOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(41)
              DW_AT_type	("classes::myRec(owned MyClass?)")
""",
  "myNilableRecordWrappedSharedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableRecordWrappedSharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(42)
              DW_AT_type	("classes::myRec(shared MyClass?)")
""",
  "myNilableRecordWrappedBorrowedClass": """
DW_TAG_variable
              DW_AT_name	("myNilableRecordWrappedBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(43)
              DW_AT_type	("classes::myRec(borrowed MyClass?)")
""",
}
from dwarfDump import run
run(symbols)
