warning: '--debug' now implies '--debug-safe-optimizations-only'. If you only want debug symbols, use '-g' or '--debug-symbols'.
0 0 0 0 0 0 0 0 0 0 | 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0
0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 | 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 | 0 0 0 0 0 0 0 0 0 0
Running DWARF verification...
Success!!
Running DWARF dump checks...
====================================myArr1D=====================================
DW_TAG_variable
              DW_AT_name	("myArr1D")
              DW_AT_decl_file	("./arrays.chpl")
              DW_AT_decl_line	(15)
              DW_AT_type	("ChapelArray::[domain(1,int(64),one)] int(64)")
================================================================================
========================[domain(1,int(64),one)] int(64)=========================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::[domain(1,int(64),one)] int(64)")
              DW_AT_name	("[domain(1,int(64),one)] int(64)")
DW_TAG_structure_type
              DW_AT_name	("[domain(1,int(64),one)] int(64)")
              DW_AT_byte_size	(0x80)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line	(1036)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularArr(1,int(64),one,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1036)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dom")
                DW_AT_type	("DefaultRectangular::domain(1,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1041)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("off")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1043)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("blk")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1044)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("sizesPerDim")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1045)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("str")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1046)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x50)
  DW_TAG_member
                DW_AT_name	("factoredOffs")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1047)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x58)
  DW_TAG_member
                DW_AT_name	("data")
                DW_AT_type	("int(64) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1051)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  DW_TAG_member
                DW_AT_name	("shiftedData")
                DW_AT_type	("int(64) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1055)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
  DW_TAG_member
                DW_AT_name	("externFreeFunc")
                DW_AT_type	("void *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1058)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x70)
  DW_TAG_member
                DW_AT_name	("externArr")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1059)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x78)
  DW_TAG_member
                DW_AT_name	("_borrowed")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1060)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x79)
  DW_TAG_member
                DW_AT_name	("callPostAlloc")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1062)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x7a)
  DW_TAG_member
                DW_AT_name	("deinitElts")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1064)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x7b)
  NULL
DW_TAG_structure_type
              DW_AT_name	("[domain(1,int(64),one)] int(64)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("DefaultRectangular::[domain(1,int(64),one)] int(64) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
=============================wide(_ddata(int(64)))==============================

================================================================================
================================_ddata(int(64))=================================
DW_TAG_pointer_type
              DW_AT_type	("int(64)")
              DW_AT_name	("_ddata(int(64))")
================================================================================
===================BaseRectangularArr(1,int(64),one,int(64))====================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularArr(1,int(64),one,int(64))")
              DW_AT_name	("BaseRectangularArr(1,int(64),one,int(64))")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularArr(1,int(64),one,int(64))")
              DW_AT_byte_size	(0x30)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line	(1134)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseArrOverRectangularDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(1134)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
====================BaseArrOverRectangularDom(1,int(64),one)====================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseArrOverRectangularDom(1,int(64),one)")
              DW_AT_name	("BaseArrOverRectangularDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("BaseArrOverRectangularDom(1,int(64),one)")
              DW_AT_byte_size	(0x30)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line	(1109)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseArr")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(1109)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=============================chpl_ddataResizePolicy=============================
DW_TAG_enumeration_type
              DW_AT_type	("int(64)")
              DW_AT_enum_class	(true)
              DW_AT_name	("ENUM_NAME")
              DW_AT_byte_size	(0x08)
              DW_AT_alignment	(8)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  DW_TAG_enumerator
                DW_AT_name	("ENUM_NAME")
                DW_AT_const_value	(ENUM_VAL)
  NULL
================================================================================
====================================BaseArr=====================================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseArr")
              DW_AT_name	("BaseArr")
DW_TAG_structure_type
              DW_AT_name	("BaseArr")
              DW_AT_byte_size	(0x30)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line	(907)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(907)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("prev")
                DW_AT_type	("ChapelDistribution::BaseArr *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(908)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("next")
                DW_AT_type	("ChapelDistribution::BaseArr *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(909)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x10)
  DW_TAG_member
                DW_AT_name	("pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(911)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x18)
  DW_TAG_member
                DW_AT_name	("_decEltRefCounts")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(912)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("_resizePolicy")
                DW_AT_type	("chpl_ddataResizePolicy")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(913)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x28)
  NULL
================================================================================
====================================myArr2D=====================================
DW_TAG_variable
              DW_AT_name	("myArr2D")
              DW_AT_decl_file	("./arrays.chpl")
              DW_AT_decl_line	(22)
              DW_AT_type	("ChapelArray::[domain(2,int(64),one)] real(32)")
================================================================================
========================[domain(2,int(64),one)] real(32)========================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::[domain(2,int(64),one)] real(32)")
              DW_AT_name	("[domain(2,int(64),one)] real(32)")
DW_TAG_structure_type
              DW_AT_name	("[domain(2,int(64),one)] real(32)")
              DW_AT_byte_size	(0xa0)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line	(1036)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularArr(2,int(64),one,real(32))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1036)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dom")
                DW_AT_type	("DefaultRectangular::domain(2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1041)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("off")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1043)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("blk")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1044)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("sizesPerDim")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1045)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x58)
  DW_TAG_member
                DW_AT_name	("str")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1046)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
  DW_TAG_member
                DW_AT_name	("factoredOffs")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1047)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x78)
  DW_TAG_member
                DW_AT_name	("data")
                DW_AT_type	("real(32) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1051)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("shiftedData")
                DW_AT_type	("real(32) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1055)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x88)
  DW_TAG_member
                DW_AT_name	("externFreeFunc")
                DW_AT_type	("void *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1058)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x90)
  DW_TAG_member
                DW_AT_name	("externArr")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1059)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x98)
  DW_TAG_member
                DW_AT_name	("_borrowed")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1060)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x99)
  DW_TAG_member
                DW_AT_name	("callPostAlloc")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1062)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x9a)
  DW_TAG_member
                DW_AT_name	("deinitElts")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1064)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x9b)
  NULL
DW_TAG_structure_type
              DW_AT_name	("[domain(2,int(64),one)] real(32)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("DefaultRectangular::[domain(2,int(64),one)] real(32) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
=============================wide(_ddata(real(32)))=============================

================================================================================
================================_ddata(real(32))================================
DW_TAG_pointer_type
              DW_AT_type	("real(32)")
              DW_AT_name	("_ddata(real(32))")
================================================================================
===================BaseRectangularArr(2,int(64),one,real(32))===================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularArr(2,int(64),one,real(32))")
              DW_AT_name	("BaseRectangularArr(2,int(64),one,real(32))")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularArr(2,int(64),one,real(32))")
              DW_AT_byte_size	(0x30)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line	(1134)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseArrOverRectangularDom(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(1134)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
====================BaseArrOverRectangularDom(2,int(64),one)====================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseArrOverRectangularDom(2,int(64),one)")
              DW_AT_name	("BaseArrOverRectangularDom(2,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("BaseArrOverRectangularDom(2,int(64),one)")
              DW_AT_byte_size	(0x30)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line	(1109)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseArr")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line	(1109)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
==================================myArr2DBlock==================================
DW_TAG_variable
              DW_AT_name	("myArr2DBlock")
              DW_AT_decl_file	("./arrays.chpl")
              DW_AT_decl_line	(29)
              DW_AT_type	("ChapelArray::[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)")
================================================================================
============[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)=============
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)")
              DW_AT_name	("[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)")
DW_TAG_structure_type
              DW_AT_name	("[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)")
              DW_AT_byte_size	(0x70)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line	(558)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularArr(2,int(64),one,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(558)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("doRADOpt")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(560)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("dom")
                DW_AT_type	("BlockDist::BlockDom(2,int(64),one,unmanaged DefaultDist) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(561)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locArr")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(562)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("myLocArr")
                DW_AT_type	("BlockDist::LocBlockArr(int(64),2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(565)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x58)
  DW_TAG_member
                DW_AT_name	("SENTINEL")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(566)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  NULL
DW_TAG_structure_type
              DW_AT_name	("[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("BlockDist::[BlockDom(2,int(64),one,unmanaged DefaultDist)] int(64) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
======[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)======
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)")
              DW_AT_name	("[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)")
              DW_AT_byte_size	(0xa0)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line	(1036)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularArr(2,int(64),one,unmanaged LocBlockArr(int(64),2,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1036)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dom")
                DW_AT_type	("DefaultRectangular::domain(2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1041)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("off")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1043)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("blk")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1044)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("sizesPerDim")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1045)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x58)
  DW_TAG_member
                DW_AT_name	("str")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1046)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
  DW_TAG_member
                DW_AT_name	("factoredOffs")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1047)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x78)
  DW_TAG_member
                DW_AT_name	("data")
                DW_AT_type	("BlockDist::LocBlockArr(int(64),2,int(64),one) **")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1051)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("shiftedData")
                DW_AT_type	("BlockDist::LocBlockArr(int(64),2,int(64),one) **")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1055)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x88)
  DW_TAG_member
                DW_AT_name	("externFreeFunc")
                DW_AT_type	("void *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1058)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x90)
  DW_TAG_member
                DW_AT_name	("externArr")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1059)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x98)
  DW_TAG_member
                DW_AT_name	("_borrowed")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1060)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x99)
  DW_TAG_member
                DW_AT_name	("callPostAlloc")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1062)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x9a)
  DW_TAG_member
                DW_AT_name	("deinitElts")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line	(1064)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x9b)
  NULL
DW_TAG_structure_type
              DW_AT_name	("[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("DefaultRectangular::[domain(2,int(64),one)] unmanaged LocBlockArr(int(64),2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
====================wide(LocBlockArr(int(64),2,int(64),one))====================

================================================================================
=======================LocBlockArr(int(64),2,int(64),one)=======================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::LocBlockArr(int(64),2,int(64),one)")
              DW_AT_name	("LocBlockArr(int(64),2,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockArr(int(64),2,int(64),one)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line	(579)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(579)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("locDom")
                DW_AT_type	("BlockDist::LocBlockDom(2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(584)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("locRAD")
                DW_AT_type	("DefaultRectangular::LocRADCache(int(64),2,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(585)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x10)
  DW_TAG_member
                DW_AT_name	("myElems")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(588)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x18)
  DW_TAG_member
                DW_AT_name	("locRADLock")
                DW_AT_type	("ChapelLocks::chpl_LocalSpinlock")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line	(589)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x30)
  NULL
================================================================================
=================================myArr1DCyclic==================================
DW_TAG_variable
              DW_AT_name	("myArr1DCyclic")
              DW_AT_decl_file	("./arrays.chpl")
              DW_AT_decl_line	(32)
              DW_AT_type	("ChapelArray::[CyclicDom(1,int(64),one)] uint(8)")
================================================================================
=======================[CyclicDom(1,int(64),one)] uint(8)=======================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::[CyclicDom(1,int(64),one)] uint(8)")
              DW_AT_name	("[CyclicDom(1,int(64),one)] uint(8)")
DW_TAG_structure_type
              DW_AT_name	("[CyclicDom(1,int(64),one)] uint(8)")
              DW_AT_byte_size	(0x68)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line	(919)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularArr(1,int(64),one,uint(8))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(919)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("doRADOpt")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(920)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("dom")
                DW_AT_type	("CyclicDist::CyclicDom(1,int(64),one) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(921)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locArr")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocCyclicArr(uint(8),1,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(923)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("myLocArr")
                DW_AT_type	("CyclicDist::LocCyclicArr(uint(8),1,int(64)) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(924)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x58)
  DW_TAG_member
                DW_AT_name	("SENTINEL")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line	(925)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  NULL
DW_TAG_structure_type
              DW_AT_name	("[CyclicDom(1,int(64),one)] uint(8)")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
              DW_AT_decl_line	(781)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(782)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("CyclicDist::[CyclicDom(1,int(64),one)] uint(8) *")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(785)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelArray.chpl")
                DW_AT_decl_line	(786)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
Success!!
