warning: '--debug' now implies '--debug-safe-optimizations-only'. If you only want debug symbols, use '-g' or '--debug-symbols'.
{x = 17} | {x = 17} | {x = 17} | {x = 17}
{x = 17, y = 3.14} | {x = 17, y = 3.14} | {x = 17, y = 3.14} | {x = 17, y = 3.14}
nil | nil | nil | nil
nil | nil | nil | nil
(x = {x = 17}) | (x = {x = 17}) | (x = {x = 17}) | (x = {x = 17})
(x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14})
(x = {x = 17}) | (x = {x = 17}) | (x = {x = 17}) | (x = {x = 17})
(x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14}) | (x = {x = 17, y = 3.14})
Running DWARF verification...
Success!!
Running DWARF dump checks...
=================================myRec(MyClass)=================================
DW_TAG_structure_type
              DW_AT_name	("myRec(MyClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
============================myRec(unmanaged MyClass)============================
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
==============================myRec(owned MyClass)==============================
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("owned MyClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=============================myRec(shared MyClass)==============================
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyClass)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("shared MyClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
============================myRec(borrowed MyClass)=============================

================================================================================
===========================myRec(unmanaged MyClass?)============================
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=============================myRec(owned MyClass?)==============================
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("owned MyClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=============================myRec(shared MyClass?)=============================
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyClass?)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("shared MyClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
============================myRec(borrowed MyClass?)============================
DW_TAG_structure_type
              DW_AT_name	("myRec(borrowed MyClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
==============================myRec(MyChildClass)===============================
DW_TAG_structure_type
              DW_AT_name	("myRec(MyChildClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyChildClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=========================myRec(unmanaged MyChildClass)==========================
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyChildClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyChildClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
===========================myRec(owned MyChildClass)============================
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyChildClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("owned MyChildClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
===========================myRec(shared MyChildClass)===========================
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyChildClass)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("shared MyChildClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
==========================myRec(borrowed MyChildClass)==========================

================================================================================
=========================myRec(unmanaged MyChildClass?)=========================
DW_TAG_structure_type
              DW_AT_name	("myRec(unmanaged MyChildClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyChildClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
===========================myRec(owned MyChildClass?)===========================
DW_TAG_structure_type
              DW_AT_name	("myRec(owned MyChildClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("owned MyChildClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
==========================myRec(shared MyChildClass?)===========================
DW_TAG_structure_type
              DW_AT_name	("myRec(shared MyChildClass?)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("shared MyChildClass?")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
=========================myRec(borrowed MyChildClass?)==========================
DW_TAG_structure_type
              DW_AT_name	("myRec(borrowed MyChildClass?)")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(22)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("wide(MyChildClass)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(23)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  NULL
================================================================================
====================================MyClass=====================================
DW_TAG_pointer_type
              DW_AT_type	("classes::MyClass")
              DW_AT_name	("MyClass")
DW_TAG_structure_type
              DW_AT_name	("MyClass")
              DW_AT_byte_size	(0x10)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(26)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(26)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("x")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(27)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
==================================MyChildClass==================================
DW_TAG_pointer_type
              DW_AT_type	("classes::MyChildClass")
              DW_AT_name	("MyChildClass")
DW_TAG_structure_type
              DW_AT_name	("MyChildClass")
              DW_AT_byte_size	(0x18)
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(30)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("classes::MyClass")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(30)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("y")
                DW_AT_type	("real(64)")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(31)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x10)
  NULL
================================================================================
=================================wide(MyClass)==================================
DW_TAG_structure_type
              DW_AT_name	("wide(MyClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(26)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("classes::MyClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(26)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
===============================wide(MyChildClass)===============================
DW_TAG_structure_type
              DW_AT_name	("wide(MyChildClass)")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(30)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("classes::MyChildClass *")
                DW_AT_decl_file	("./classes.chpl")
                DW_AT_decl_line	(30)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
======================wide(_ref(myRec(unmanaged MyClass)))======================
DW_TAG_structure_type
              DW_AT_name	("wide(_ref(myRec(unmanaged MyClass)))")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("_ref(myRec(unmanaged MyClass))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
=========================_ref(myRec(unmanaged MyClass))=========================
DW_TAG_typedef
              DW_AT_type	("classes::myRec(unmanaged MyClass) &")
              DW_AT_name	("_ref(myRec(unmanaged MyClass))")
================================================================================
=====================wide(_ref(myRec(unmanaged MyClass?)))======================
DW_TAG_structure_type
              DW_AT_name	("wide(_ref(myRec(unmanaged MyClass?)))")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("_ref(myRec(unmanaged MyClass?))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
========================_ref(myRec(unmanaged MyClass?))=========================
DW_TAG_typedef
              DW_AT_type	("classes::myRec(unmanaged MyClass?) &")
              DW_AT_name	("_ref(myRec(unmanaged MyClass?))")
================================================================================
===================wide(_ref(myRec(unmanaged MyChildClass?)))===================
DW_TAG_structure_type
              DW_AT_name	("wide(_ref(myRec(unmanaged MyChildClass?)))")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("_ref(myRec(unmanaged MyChildClass?))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
======================_ref(myRec(unmanaged MyChildClass?))======================
DW_TAG_typedef
              DW_AT_type	("classes::myRec(unmanaged MyChildClass?) &")
              DW_AT_name	("_ref(myRec(unmanaged MyChildClass?))")
================================================================================
===================wide(_ref(myRec(unmanaged MyChildClass?)))===================
DW_TAG_structure_type
              DW_AT_name	("wide(_ref(myRec(unmanaged MyChildClass?)))")
              DW_AT_byte_size	(0x10)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("locale")
                DW_AT_type	("chpl_localeID_t")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("addr")
                DW_AT_type	("_ref(myRec(unmanaged MyChildClass?))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelBase.chpl")
                DW_AT_decl_line	(1854)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  NULL
================================================================================
======================_ref(myRec(unmanaged MyChildClass?))======================
DW_TAG_typedef
              DW_AT_type	("classes::myRec(unmanaged MyChildClass?) &")
              DW_AT_name	("_ref(myRec(unmanaged MyChildClass?))")
================================================================================
================================chpl_localeID_t=================================
DW_TAG_structure_type
              DW_AT_name	("chpl_localeID_t")
              DW_AT_byte_size	(0x04)
              DW_AT_alignment	(4)
  DW_TAG_member
                DW_AT_name	("node")
                DW_AT_type	("int(32)")
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x00)
  NULL
DW_TAG_typedef
              DW_AT_type	("structure ")
              DW_AT_name	("chpl_localeID_t")
              DW_AT_decl_file	("$CHPL_HOME/runtime/include/localeModels/flat/chpl-locale-model.h")
              DW_AT_decl_line	(36)
DW_TAG_typedef
              DW_AT_type	("structure ")
              DW_AT_name	("chpl_localeID_t")
              DW_AT_decl_file	("$CHPL_HOME/runtime/src/../include/localeModels/flat/chpl-locale-model.h")
              DW_AT_decl_line	(36)
DW_TAG_typedef
              DW_AT_type	("structure ")
              DW_AT_name	("chpl_localeID_t")
              DW_AT_decl_file	("$CHPL_HOME/runtime/src/../include/localeModels/flat/chpl-locale-model.h")
              DW_AT_decl_line	(36)
DW_TAG_typedef
              DW_AT_type	("structure ")
              DW_AT_name	("chpl_localeID_t")
              DW_AT_decl_file	("$CHPL_HOME/runtime/src/../include/localeModels/flat/chpl-locale-model.h")
              DW_AT_decl_line	(36)
DW_TAG_typedef
              DW_AT_type	("structure ")
              DW_AT_name	("chpl_localeID_t")
              DW_AT_decl_file	("$CHPL_HOME/runtime/src/comm/COMM_IMPL/../../../include/localeModels/flat/chpl-locale-model.h")
              DW_AT_decl_line	(36)
================================================================================
================================myUnmanagedClass================================
DW_TAG_formal_parameter
              DW_AT_name	("myUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(49)
              DW_AT_type	("wide(MyClass)")
DW_TAG_variable
              DW_AT_name	("myUnmanagedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(49)
              DW_AT_type	("classes::MyClass *")
================================================================================
==================================myOwnedClass==================================
DW_TAG_formal_parameter
              DW_AT_name	("myOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(52)
              DW_AT_type	("_ref(owned MyClass)")
DW_TAG_variable
              DW_AT_name	("myOwnedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(52)
              DW_AT_type	("owned MyClass")
================================================================================
=================================mySharedClass==================================
DW_TAG_formal_parameter
              DW_AT_name	("mySharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(54)
              DW_AT_type	("_ref(shared MyClass)")
DW_TAG_variable
              DW_AT_name	("mySharedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(54)
              DW_AT_type	("shared MyClass")
================================================================================
================================myBorrowedClass=================================
DW_TAG_formal_parameter
              DW_AT_name	("myBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(56)
              DW_AT_type	("wide(MyClass)")
DW_TAG_variable
              DW_AT_name	("myBorrowedClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(56)
              DW_AT_type	("wide(MyClass)")
================================================================================
=============================myUnmanagedChildClass==============================
DW_TAG_formal_parameter
              DW_AT_name	("myUnmanagedChildClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(58)
              DW_AT_type	("wide(MyChildClass)")
DW_TAG_variable
              DW_AT_name	("myUnmanagedChildClass")
              DW_AT_decl_file	("./classes.chpl")
              DW_AT_decl_line	(58)
