warning: '--debug' now implies '--debug-safe-optimizations-only'. If you only want debug symbols, use '-g' or '--debug-symbols'.
{1..10} | {1..10, 1..10} | {1..10 by 2} | {1..20 by -1} | {1..0} | {0..15}
{5, 7, 9, 3, 1} | {cherry, apple, banana}
{1 9}
{1..100} | {1..10 by 2, 1..10} | {-5..15}
{1..100} | {1..10 by 2, 1..10} | {5..15}
{1..100} | {1..10 by 2, 1..10}
Running DWARF verification...
Success!!
Running DWARF dump checks...
==================================DefaultDist===================================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::DefaultDist")
              DW_AT_name	("DefaultDist")
DW_TAG_structure_type
              DW_AT_name	("DefaultDist")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("DefaultDist")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
====================================BaseDist====================================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseDist")
              DW_AT_name	("BaseDist")
DW_TAG_structure_type
              DW_AT_name	("BaseDist")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_doms_containing_dist")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_domsLock")
                DW_AT_type	("ChapelLocks::chpl_LocalSpinlock")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x10)
  DW_TAG_member
                DW_AT_name	("_free_when_no_doms")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x11)
  DW_TAG_member
                DW_AT_name	("pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x18)
================================================================================
===================================myDomain1D===================================
DW_TAG_variable
              DW_AT_name	("myDomain1D")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(15)
              DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
================================================================================
=============================domain(1,int(64),one)==============================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::domain(1,int(64),one)")
              DW_AT_name	("domain(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(domain(1,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),one)")
              DW_AT_byte_size	(0x58)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("ranges")
                DW_AT_type	("range(int(64),both,one)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
================================================================================
=======================BaseRectangularDom(1,int(64),one)========================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),one)")
              DW_AT_name	("BaseRectangularDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularDom(1,int(64),one)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDom")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
===================================myDomain2D===================================
DW_TAG_variable
              DW_AT_name	("myDomain2D")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(19)
              DW_AT_type	("ChapelDomain::domain(2,int(64),one)")
================================================================================
=============================domain(2,int(64),one)==============================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::domain(2,int(64),one)")
              DW_AT_name	("domain(2,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("domain(2,int(64),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(domain(2,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("domain(2,int(64),one)")
              DW_AT_byte_size	(0x68)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("ranges")
                DW_AT_type	("range(int(64),both,one)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
================================================================================
=======================BaseRectangularDom(2,int(64),one)========================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularDom(2,int(64),one)")
              DW_AT_name	("BaseRectangularDom(2,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularDom(2,int(64),one)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDom")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
==================================myStridedDom==================================
DW_TAG_variable
              DW_AT_name	("myStridedDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(23)
              DW_AT_type	("ChapelDomain::domain(1,int(64),positive)")
================================================================================
===========================domain(1,int(64),positive)===========================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::domain(1,int(64),positive)")
              DW_AT_name	("domain(1,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),positive)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(domain(1,int(64),positive))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),positive)")
              DW_AT_byte_size	(0x68)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("ranges")
                DW_AT_type	("range(int(64),both,positive)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
================================================================================
=====================BaseRectangularDom(1,int(64),positive)=====================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),positive)")
              DW_AT_name	("BaseRectangularDom(1,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularDom(1,int(64),positive)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDom")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
==================================myReverseDom==================================
DW_TAG_variable
              DW_AT_name	("myReverseDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(27)
              DW_AT_type	("ChapelDomain::domain(1,int(64),negOne)")
================================================================================
============================domain(1,int(64),negOne)============================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::domain(1,int(64),negOne)")
              DW_AT_name	("domain(1,int(64),negOne)")
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),negOne)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(domain(1,int(64),negOne))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("domain(1,int(64),negOne)")
              DW_AT_byte_size	(0x58)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),negOne)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("ranges")
                DW_AT_type	("range(int(64),both,negOne)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
================================================================================
======================BaseRectangularDom(1,int(64),negOne)======================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),negOne)")
              DW_AT_name	("BaseRectangularDom(1,int(64),negOne)")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularDom(1,int(64),negOne)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDom")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
===================================myEmptyDom===================================
DW_TAG_variable
              DW_AT_name	("myEmptyDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(29)
              DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
================================================================================
===================================myUintDom====================================
DW_TAG_variable
              DW_AT_name	("myUintDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(33)
              DW_AT_type	("ChapelDomain::domain(1,uint(32),one)")
================================================================================
=============================domain(1,uint(32),one)=============================
DW_TAG_pointer_type
              DW_AT_type	("DefaultRectangular::domain(1,uint(32),one)")
              DW_AT_name	("domain(1,uint(32),one)")
DW_TAG_structure_type
              DW_AT_name	("domain(1,uint(32),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(domain(1,uint(32),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("domain(1,uint(32),one)")
              DW_AT_byte_size	(0x50)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,uint(32),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("ranges")
                DW_AT_type	("range(uint(32),both,one)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultRectangular.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(4)
                DW_AT_data_member_location	(0x48)
================================================================================
=======================BaseRectangularDom(1,uint(32),one)=======================
DW_TAG_pointer_type
              DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,uint(32),one)")
              DW_AT_name	("BaseRectangularDom(1,uint(32),one)")
DW_TAG_structure_type
              DW_AT_name	("BaseRectangularDom(1,uint(32),one)")
              DW_AT_byte_size	(0x38)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDom")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDistribution.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
================================================================================
===================================myAssocDom===================================
DW_TAG_variable
              DW_AT_name	("myAssocDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(41)
              DW_AT_type	("ChapelDomain::DefaultAssociativeDom(int(64),false)")
================================================================================
================================myAssocStringDom================================
DW_TAG_variable
              DW_AT_name	("myAssocStringDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(43)
              DW_AT_type	("ChapelDomain::DefaultAssociativeDom(string,false)")
================================================================================
==================================mySparseDom===================================
DW_TAG_variable
              DW_AT_name	("mySparseDom")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(52)
              DW_AT_type	("ChapelDomain::DefaultSparseDom(1,int(64),domain(1,int(64),one))")
================================================================================
===============DefaultSparseDom(1,int(64),domain(1,int(64),one))================
DW_TAG_pointer_type
              DW_AT_type	("DefaultSparse::DefaultSparseDom(1,int(64),domain(1,int(64),one))")
              DW_AT_name	("DefaultSparseDom(1,int(64),domain(1,int(64),one))")
DW_TAG_structure_type
              DW_AT_name	("DefaultSparseDom(1,int(64),domain(1,int(64),one))")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(DefaultSparseDom(1,int(64),domain(1,int(64),one)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
DW_TAG_structure_type
              DW_AT_name	("DefaultSparseDom(1,int(64),domain(1,int(64),one))")
              DW_AT_byte_size	(0xb0)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultSparse.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseSparseDomImpl(1,int(64),domain(1,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultSparse.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(DefaultDist)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultSparse.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x78)
  DW_TAG_member
                DW_AT_name	("_nnz")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultSparse.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x88)
  DW_TAG_member
                DW_AT_name	("_indices")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/DefaultSparse.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x90)
================================================================================
==================================myBlockDist===================================
DW_TAG_variable
              DW_AT_name	("myBlockDist")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(65)
              DW_AT_type	("ChapelDomain::BlockDom(1,int(64),one,unmanaged DefaultDist)")
================================================================================
=================BlockDom(1,int(64),one,unmanaged DefaultDist)==================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockDom(1,int(64),one,unmanaged DefaultDist)")
              DW_AT_name	("BlockDom(1,int(64),one,unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockDom(1,int(64),one,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(BlockImpl(1,int(64),unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlockDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("BlockDom(1,int(64),one,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(BlockDom(1,int(64),one,unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
===========================LocBlockDom(1,int(64),one)===========================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::LocBlockDom(1,int(64),one)")
              DW_AT_name	("LocBlockDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockDom(1,int(64),one)")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
===================BlockImpl(1,int(64),unmanaged DefaultDist)===================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockImpl(1,int(64),unmanaged DefaultDist)")
              DW_AT_name	("BlockImpl(1,int(64),unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockImpl(1,int(64),unmanaged DefaultDist)")
              DW_AT_byte_size	(0xb8)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("boundingBox")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("targetLocDom")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("targetLocales")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] locale")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  DW_TAG_member
                DW_AT_name	("locDist")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlock(1,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("dataParTasksPerLocale")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xa0)
  DW_TAG_member
                DW_AT_name	("dataParIgnoreRunningTasks")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0xa8)
  DW_TAG_member
                DW_AT_name	("dataParMinGranularity")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xb0)
================================================================================
=================================myBlockDist2D==================================
DW_TAG_variable
              DW_AT_name	("myBlockDist2D")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(71)
              DW_AT_type	("ChapelDomain::BlockDom(2,int(64),positive,unmanaged DefaultDist)")
================================================================================
===============BlockDom(2,int(64),positive,unmanaged DefaultDist)===============
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockDom(2,int(64),positive,unmanaged DefaultDist)")
              DW_AT_name	("BlockDom(2,int(64),positive,unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockDom(2,int(64),positive,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(BlockImpl(2,int(64),unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocBlockDom(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("BlockDom(2,int(64),positive,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(BlockDom(2,int(64),positive,unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
========================LocBlockDom(2,int(64),positive)=========================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::LocBlockDom(2,int(64),positive)")
              DW_AT_name	("LocBlockDom(2,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockDom(2,int(64),positive)")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
===================BlockImpl(2,int(64),unmanaged DefaultDist)===================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockImpl(2,int(64),unmanaged DefaultDist)")
              DW_AT_name	("BlockImpl(2,int(64),unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockImpl(2,int(64),unmanaged DefaultDist)")
              DW_AT_byte_size	(0xb8)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("boundingBox")
                DW_AT_type	("ChapelDomain::domain(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("targetLocDom")
                DW_AT_type	("ChapelDomain::domain(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("targetLocales")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] locale")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  DW_TAG_member
                DW_AT_name	("locDist")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocBlock(2,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("dataParTasksPerLocale")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xa0)
  DW_TAG_member
                DW_AT_name	("dataParIgnoreRunningTasks")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0xa8)
  DW_TAG_member
                DW_AT_name	("dataParMinGranularity")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xb0)
================================================================================
==============================LocBlock(2,int(64))===============================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::LocBlock(2,int(64))")
              DW_AT_name	("LocBlock(2,int(64))")
DW_TAG_structure_type
              DW_AT_name	("LocBlock(2,int(64))")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myChunk")
                DW_AT_type	("ChapelDomain::domain(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
================================myBlockDistInt16================================
DW_TAG_variable
              DW_AT_name	("myBlockDistInt16")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(76)
              DW_AT_type	("ChapelDomain::BlockDom(1,int(16),one,unmanaged DefaultDist)")
================================================================================
=================BlockDom(1,int(16),one,unmanaged DefaultDist)==================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockDom(1,int(16),one,unmanaged DefaultDist)")
              DW_AT_name	("BlockDom(1,int(16),one,unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockDom(1,int(16),one,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(16),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(BlockImpl(1,int(16),unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlockDom(1,int(16),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(1,int(16),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("BlockDom(1,int(16),one,unmanaged DefaultDist)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(BlockDom(1,int(16),one,unmanaged DefaultDist))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
===========================LocBlockDom(1,int(16),one)===========================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::LocBlockDom(1,int(16),one)")
              DW_AT_name	("LocBlockDom(1,int(16),one)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockDom(1,int(16),one)")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(1,int(16),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
===================BlockImpl(1,int(16),unmanaged DefaultDist)===================
DW_TAG_pointer_type
              DW_AT_type	("BlockDist::BlockImpl(1,int(16),unmanaged DefaultDist)")
              DW_AT_name	("BlockImpl(1,int(16),unmanaged DefaultDist)")
DW_TAG_structure_type
              DW_AT_name	("BlockImpl(1,int(16),unmanaged DefaultDist)")
              DW_AT_byte_size	(0xb8)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("boundingBox")
                DW_AT_type	("ChapelDomain::domain(1,int(16),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("targetLocDom")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("targetLocales")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] locale")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  DW_TAG_member
                DW_AT_name	("locDist")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlock(1,int(16))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("dataParTasksPerLocale")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xa0)
  DW_TAG_member
                DW_AT_name	("dataParIgnoreRunningTasks")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0xa8)
  DW_TAG_member
                DW_AT_name	("dataParMinGranularity")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xb0)
================================================================================
==================================myCyclicDist==================================
DW_TAG_variable
              DW_AT_name	("myCyclicDist")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(87)
              DW_AT_type	("ChapelDomain::CyclicDom(1,int(64),one)")
================================================================================
============================CyclicDom(1,int(64),one)============================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::CyclicDom(1,int(64),one)")
              DW_AT_name	("CyclicDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(1,int(64),one)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(CyclicImpl(1,int(64)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocCyclicDom(1,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(1,int(64),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(CyclicDom(1,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
============================LocCyclicDom(1,int(64))=============================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::LocCyclicDom(1,int(64))")
              DW_AT_name	("LocCyclicDom(1,int(64))")
DW_TAG_structure_type
              DW_AT_name	("LocCyclicDom(1,int(64))")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(1,int(64),any)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
=================================myCyclicDist2D=================================
DW_TAG_variable
              DW_AT_name	("myCyclicDist2D")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(92)
              DW_AT_type	("ChapelDomain::CyclicDom(2,int(64),positive)")
================================================================================
=========================CyclicDom(2,int(64),positive)==========================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::CyclicDom(2,int(64),positive)")
              DW_AT_name	("CyclicDom(2,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(2,int(64),positive)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(CyclicImpl(2,int(64)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocCyclicDom(2,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(2,int(64),positive)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(CyclicDom(2,int(64),positive))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
============================LocCyclicDom(2,int(64))=============================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::LocCyclicDom(2,int(64))")
              DW_AT_name	("LocCyclicDom(2,int(64))")
DW_TAG_structure_type
              DW_AT_name	("LocCyclicDom(2,int(64))")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(2,int(64),any)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
================================myCyclicDistUint================================
DW_TAG_variable
              DW_AT_name	("myCyclicDistUint")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(97)
              DW_AT_type	("ChapelDomain::CyclicDom(1,uint(32),one)")
================================================================================
===========================CyclicDom(1,uint(32),one)============================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::CyclicDom(1,uint(32),one)")
              DW_AT_name	("CyclicDom(1,uint(32),one)")
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(1,uint(32),one)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,uint(32),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(CyclicImpl(1,uint(32)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDoms")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocCyclicDom(1,uint(32))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(1,uint(32),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("CyclicDom(1,uint(32),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(CyclicDom(1,uint(32),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
============================LocCyclicDom(1,uint(32))============================
DW_TAG_pointer_type
              DW_AT_type	("CyclicDist::LocCyclicDom(1,uint(32))")
              DW_AT_name	("LocCyclicDom(1,uint(32))")
DW_TAG_structure_type
              DW_AT_name	("LocCyclicDom(1,uint(32))")
              DW_AT_byte_size	(0x28)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("myBlock")
                DW_AT_type	("ChapelDomain::domain(1,uint(32),any)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/CyclicDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
================================================================================
===============================myBlockCyclicDist================================
DW_TAG_variable
              DW_AT_name	("myBlockCyclicDist")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(108)
              DW_AT_type	("ChapelDomain::BlockCyclicDom(1,int(64),one)")
================================================================================
=========================BlockCyclicDom(1,int(64),one)==========================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::BlockCyclicDom(1,int(64),one)")
              DW_AT_name	("BlockCyclicDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicDom(1,int(64),one)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(BlockCyclicImpl(1,int(64)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDomsNil")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlockCyclicDom(1,int(64),one)?")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicDom(1,int(64),one)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(BlockCyclicDom(1,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
========================LocBlockCyclicDom(1,int(64),one)========================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::LocBlockCyclicDom(1,int(64),one)")
              DW_AT_name	("LocBlockCyclicDom(1,int(64),one)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockCyclicDom(1,int(64),one)")
              DW_AT_byte_size	(0x58)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("globDom")
                DW_AT_type	("wide(BlockCyclicDom(1,int(64),one))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("myStarts")
                DW_AT_type	("ChapelDomain::domain(1,int(64),any)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x18)
  DW_TAG_member
                DW_AT_name	("myFlatInds")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
================================================================================
===========================BlockCyclicImpl(1,int(64))===========================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::BlockCyclicImpl(1,int(64))")
              DW_AT_name	("BlockCyclicImpl(1,int(64))")
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicImpl(1,int(64))")
              DW_AT_byte_size	(0x98)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("lowIdx")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("blocksize")
                DW_AT_type	("int(64)[1]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x28)
  DW_TAG_member
                DW_AT_name	("targetLocDom")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("targetLocales")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] locale")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x50)
  DW_TAG_member
                DW_AT_name	("locDist")
                DW_AT_type	("ChapelArray::[domain(1,int(64),one)] unmanaged LocBlockCyclic(1,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x70)
  DW_TAG_member
                DW_AT_name	("dataParTasksPerLocale")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x90)
================================================================================
==============================myBlockCyclicDist2D===============================
DW_TAG_variable
              DW_AT_name	("myBlockCyclicDist2D")
              DW_AT_decl_file	("./domains.chpl")
              DW_AT_decl_line	(113)
              DW_AT_type	("ChapelDomain::BlockCyclicDom(2,int(64),positive)")
================================================================================
=======================BlockCyclicDom(2,int(64),positive)=======================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::BlockCyclicDom(2,int(64),positive)")
              DW_AT_name	("BlockCyclicDom(2,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicDom(2,int(64),positive)")
              DW_AT_byte_size	(0x88)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseRectangularDom(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("dist")
                DW_AT_type	("wide(BlockCyclicImpl(2,int(64)))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
  DW_TAG_member
                DW_AT_name	("locDomsNil")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocBlockCyclicDom(2,int(64),positive)?")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x48)
  DW_TAG_member
                DW_AT_name	("whole")
                DW_AT_type	("ChapelDomain::domain(2,int(64),positive)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x68)
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicDom(2,int(64),positive)")
              DW_AT_byte_size	(0x20)
              DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("_pid")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("_instance")
                DW_AT_type	("wide(BlockCyclicDom(2,int(64),positive))")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("_unowned")
                DW_AT_type	("bool")
                DW_AT_decl_file	("$CHPL_HOME/modules/internal/ChapelDomain.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(1)
                DW_AT_data_member_location	(0x18)
================================================================================
=====================LocBlockCyclicDom(2,int(64),positive)======================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::LocBlockCyclicDom(2,int(64),positive)")
              DW_AT_name	("LocBlockCyclicDom(2,int(64),positive)")
DW_TAG_structure_type
              DW_AT_name	("LocBlockCyclicDom(2,int(64),positive)")
              DW_AT_byte_size	(0x58)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("RootClass")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("globDom")
                DW_AT_type	("wide(BlockCyclicDom(2,int(64),positive))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x08)
  DW_TAG_member
                DW_AT_name	("myStarts")
                DW_AT_type	("ChapelDomain::domain(2,int(64),any)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x18)
  DW_TAG_member
                DW_AT_name	("myFlatInds")
                DW_AT_type	("ChapelDomain::domain(1,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x38)
================================================================================
===========================BlockCyclicImpl(2,int(64))===========================
DW_TAG_pointer_type
              DW_AT_type	("BlockCycDist::BlockCyclicImpl(2,int(64))")
              DW_AT_name	("BlockCyclicImpl(2,int(64))")
DW_TAG_structure_type
              DW_AT_name	("BlockCyclicImpl(2,int(64))")
              DW_AT_byte_size	(0xa8)
              DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
              DW_AT_decl_line (INTERNAL_LINENO)
              DW_AT_alignment	(8)
  DW_TAG_member
                DW_AT_name	("super")
                DW_AT_type	("ChapelDistribution::BaseDist")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x00)
  DW_TAG_member
                DW_AT_name	("lowIdx")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x20)
  DW_TAG_member
                DW_AT_name	("blocksize")
                DW_AT_type	("int(64)[2]")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x30)
  DW_TAG_member
                DW_AT_name	("targetLocDom")
                DW_AT_type	("ChapelDomain::domain(2,int(64),one)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x40)
  DW_TAG_member
                DW_AT_name	("targetLocales")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] locale")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x60)
  DW_TAG_member
                DW_AT_name	("locDist")
                DW_AT_type	("ChapelArray::[domain(2,int(64),one)] unmanaged LocBlockCyclic(2,int(64))")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0x80)
  DW_TAG_member
                DW_AT_name	("dataParTasksPerLocale")
                DW_AT_type	("int(64)")
                DW_AT_decl_file	("$CHPL_HOME/modules/dists/BlockCycDist.chpl")
                DW_AT_decl_line (INTERNAL_LINENO)
                DW_AT_alignment	(8)
                DW_AT_data_member_location	(0xa0)
================================================================================
Success!!
